{
    "name": "Amy Churchwell",
    "title": "Front End Software Engineer",
    "description": "User-centric front end software engineer with experience working on large-scale projects on distributed teams. Passionate about open source, accessibility, and web performance.",
    "technologies": [
        "HTML",
        "CSS",
        "Sass",
        "Less",
        "JavaScript ES6",
        "React",
        "Redux",
        "Angular",
        "jQuery",
        "Django",
        "Git",
        "Mercurial",
        "Gulp",
        "Webpack",
        "Node.js",
        "Typescript",
        "Karma",
        "Jasmine",
        "Mocha",
        "Selenium"
    ],
    "experience": [
        {
            "company": "Mozilla",
            "companyWebsite": "https://www.mozilla.org",
            "role": "Front End Software Engineer",
            "startDate": 2018,
            "projects": [
                {
                    "title": "Firefox Desktop",
                    "description": "Firefox is a privacy-focused open source web browser. Supported on Mac, Windows, and Linux.",
                    "details": [
                      "Entered existing codebase to take sole ownership in a large, in-progress redesign of Firefox’s New Tab Page, a surface that supports ~400 million daily sessions. Using React, Redux, Sass, Mocha.",
                      "Partnered with product management, QA, UX and content designers to develop and execute a roadmap that balanced new features with ongoing product quality work.",
                      "Triaged and tracked bugs using Bugzilla and Jira.",
                      "Participant in diversity & inclusion initiative, Mozilla Inclusion Champions, which directly informed Mozilla’s engineering hiring and promotion practices.",
                      "Refactored large parts of the Firefox front end to support new theming features."
                    ]
                },
                {
                    "title": "mozilla.org",
                    "description": "mozilla.org is a large-scale, open-source Django web application that serves millions of users each day.",
                    "details": [
                      "Balanced fast-paced feature building with the maintenance and technical roadmapping of a long-term project.",
                      "Wrote functional tests with Selenium and pytest. Behavioral unit tests with Jasmine and Karma.",
                      "Used progressive enhancement best practices for cross-browser compatibility. Enhanced support for  IE10+, with basic support for IE9 and below.",
                      "Mentored and onboarded junior developers."
                    ]
                },
                {
                    "title": "Conversion Rate Optimization",
                    "description": "",
                    "details": [
                      "Led engineering on the Conversion Rate Optimization team, experiments deployed within the first 6 months predicted to earn an additional 2.54 million desktop downloads per year.",
                      "Collaborated with product engineering teams to deliver in-house JavaScript A/B testing platforms on multiple Mozilla web properties."
                    ]
                },
                {
                    "title": "Protocol Design System",
                    "description": "protocol.mozilla.org is Mozilla’s modular web design system. Node.js platform, published to NPM.",
                    "details": [
                      "Built responsive and accessible web components using Sass CSS preprocessing.",
                      "Wrote cross-browser compatible JavaScript with unit tests."
                    ]
                }
            ]
        },
        {
            "company": "Pancake Creative",
            "role": "Front End Web Developer",
            "startDate": 2018,
            "endDate": 2018,
            "highlights": [
                "Refactored legacy Angular application to React. Used Redux for state management.",
                "Delivered reusable components and stateful app features reflecting brand guidelines and user stories."
            ]
        }
    ],
    "volunteer": [
        {
            "org": "Women Who Code",
            "role": "Front End Web Developer",
            "startDate": 2018,
            "endDate": 2020,
            "highlights": [
                "Spearheaded development of maintainable and performant React codebase from the ground-up.",
                "Triaged and mentored bugs, helping foster the local open source community."
            ]
        }
    ],
    "education": [
        {
            "school": "Epicodus",
            "startDate": 2017,
            "endDate": 2018,
            "description": "Vocational school for programmers. Specialized in Front End Web Development."
        },
        {
            "school": "University of West Florida",
            "startDate": 2012,
            "endDate": 2013,
            "description": "BA, Graphic Design."
        },
        {
            "school": "School of Visual Arts",
            "startDate": 2011,
            "endDate": 2012,
            "description": "BFA Graphic Design courses."
        }
    ]
}
